# 算術運算符
# + 加法運算符（如果是兩個字符串之間進行加法運算，則會進行拼串操作）
# - 減法運算符
# * 乘法運算符（如果將字符串和數字相乘，則會對字符串進行複制操作，將字符串重複指定次數）
# / 除法運算符，運算時結果總會返回一個浮點類型
# // 整除，只會保留計算後的整數位，總會返回一個整型
# ** 冪運算，求一個值的幾次冪
# % 取模，求兩個數相除的餘數

a = 10 + 5 # 計算
a = 'hello' + ' ' + 'world' # 拼串

a = 10 - 5 # 計算
a = 5 - True 
a = a - 2 # 用變量a的值減去2，然後再賦值給a
# a = 'hello' - 'h' TypeError

a = 5 * 5

a = 10 / 5
a = 5 / 2
# a = 5 / 0 ZeroDivisionError: division by zero
a = 10 / 3
a = 10 // 3
a = 5 // 2 

a = 2 ** 2
a = 10 ** 5
a = 16 ** 0.5 # 求16的平方根

a = 10 % 5 # 0
a = 10 % 4 # 2
a = 10 % 3 # 1
a = 10 % 2 # 0

print("a =",a)